Swarm/cloudlab/results/nomad-sn-wrk-home.txt
Running 30s test @ http://node3.stvdp-112731.sched-serv-pg0.utah.cloudlab.us:8080/wrk2-api/home-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 1.352ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.401ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.389ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.348ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.33ms  255.14us   2.29ms   75.28%
    Req/Sec    52.81     75.43   300.00     90.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.32ms
 75.000%    1.47ms
 90.000%    1.60ms
 99.000%    2.29ms
 99.900%    2.81ms
 99.990%    3.12ms
 99.999%    3.12ms
100.000%    3.12ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.665     0.000000            1         1.00
       1.030     0.100000          401         1.11
       1.131     0.200000          801         1.25
       1.200     0.300000         1203         1.43
       1.264     0.400000         1598         1.67
       1.320     0.500000         1997         2.00
       1.347     0.550000         2202         2.22
       1.372     0.600000         2397         2.50
       1.402     0.650000         2596         2.86
       1.436     0.700000         2803         3.33
       1.467     0.750000         2996         4.00
       1.482     0.775000         3095         4.44
       1.501     0.800000         3197         5.00
       1.520     0.825000         3294         5.71
       1.540     0.850000         3393         6.67
       1.569     0.875000         3493         8.00
       1.580     0.887500         3541         8.89
       1.596     0.900000         3591        10.00
       1.615     0.912500         3645        11.43
       1.631     0.925000         3690        13.33
       1.651     0.937500         3740        16.00
       1.666     0.943750         3765        17.78
       1.684     0.950000         3790        20.00
       1.700     0.956250         3815        22.86
       1.729     0.962500         3841        26.67
       1.768     0.968750         3865        32.00
       1.817     0.971875         3877        35.56
       1.884     0.975000         3890        40.00
       1.946     0.978125         3902        45.71
       1.993     0.981250         3915        53.33
       2.063     0.984375         3927        64.00
       2.129     0.985938         3933        71.11
       2.193     0.987500         3940        80.00
       2.257     0.989062         3946        91.43
       2.337     0.990625         3953       106.67
       2.373     0.992188         3959       128.00
       2.383     0.992969         3961       142.22
       2.467     0.993750         3965       160.00
       2.537     0.994531         3968       182.86
       2.565     0.995313         3971       213.33
       2.595     0.996094         3974       256.00
       2.609     0.996484         3975       284.44
       2.643     0.996875         3977       320.00
       2.661     0.997266         3979       365.71
       2.675     0.997656         3980       426.67
       2.715     0.998047         3982       512.00
       2.715     0.998242         3982       568.89
       2.741     0.998437         3983       640.00
       2.749     0.998633         3984       731.43
       2.811     0.998828         3985       853.33
       2.821     0.999023         3986      1024.00
       2.821     0.999121         3986      1137.78
       2.821     0.999219         3986      1280.00
       2.845     0.999316         3987      1462.86
       2.845     0.999414         3987      1706.67
       2.901     0.999512         3988      2048.00
       2.901     0.999561         3988      2275.56
       2.901     0.999609         3988      2560.00
       2.901     0.999658         3988      2925.71
       2.901     0.999707         3988      3413.33
       3.119     0.999756         3989      4096.00
       3.119     1.000000         3989          inf
#[Mean    =        1.329, StdDeviation   =        0.255]
#[Max     =        3.118, Total count    =         3989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5993 requests in 30.00s, 1.14MB read
Requests/sec:    199.74
Transfer/sec:     38.82KB